//
//  Data.swift
//  Navigation
//
//  Created by Никита Морозов on 28.04.2026.
//

import Foundation
import StorageService

let posts: [Post] = [
    Post(author: "BMW", description: "BMW E39 (1995–2004) — четвертое поколение 5-й серии, легенда немецкого автопрома, сочетающая комфорт, отличную управляемость и премиальные материалы. Оснащалась надежными бензиновыми (2.0-4.4 л) и дизельными моторами. Ключевые проблемы сегодня — коррозия (днище, арки) и высокий износ из-за возраста. Цена сильно варьируется: от 200 тыс. рублей до 5 млн.", image: "bmw_e39", likes: 39, views: 10039),
    Post(author: "Porsche", description: "Porsche 997 — это шестое поколение немецкого спортивного автомобиля Porsche 911, выпускавшееся с 2004 по 2012 год. Данная модель считается одним из успешных поколений в истории 911-х, придя на смену кузову 996 и вернув фирменные круглые фары.", image: "porsche_997", likes: 997, views: 10997),
    Post(author: "Mercedes-Benz", description: "Mercedes-Benz W211 (2002–2009) — третье поколение E-класса, сочетающее высокую комфортность, надежные дизельные (OM642) и бензиновые моторы, а также классический дизайн. Модель предлагалась в кузовах седан и универсал, отличалась широкой гаммой силовых агрегатов и сложной электроникой. Основные проблемы связаны с тормозной системой SBC и коррозией.", image: "mercedes-benz_211", likes: 211, views: 10211),
    Post(author: "Volkswagen", description: "Volkswagen Golf II (1983–1992) — легендарный немецкий хэтчбек C-класса, ставший эталоном надежности и практичности. Выпущено более 6,3 млн штук. Отличается легендарной выносливостью, простотой конструкции и неприхотливостью, за что получил народное признание, часто именуясь 'Второй носок'. Предлагался с широкой гаммой бензиновых и дизельных двигателей, включая передний и полный привод.", image: "volkswagen-golf_2", likes: 2, views: 1002)
]
